Revit 2026 API

# ControlledApplicationProduct Property

---
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ProductType Product { get; }
```
```vb
Public ReadOnly Property Product As ProductType
	Get
```
```cpp
public:
property ProductType Product {
	ProductType get ();
}
```
```fsharp
member Product : ProductType with get
```

#### Property Value

ProductType

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace